<a href="https://colab.research.google.com/github/KryssyCo/DS-Unit-3-Sprint-2-SQL-and-Databases/blob/master/Krista_Shepard_U3S2M1_Assignment_1_Part_2_Intro_to_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import sqlite3

### Loaded the data from the provided file buddymove_holidayiq.csv 
### I have 249 rows, 7 columns, and no missing values.

In [5]:
buddy = pd.read_csv('https://raw.githubusercontent.com/KryssyCo/'
                    'DS-Unit-3-Sprint-2-SQL-and-Databases/master/'
                    'module1-introduction-to-sql/buddymove_holidayiq.csv')
print(buddy.shape)
buddy.head()

(249, 7)

  User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
0  User 1       2         77      79       69        68      95
1  User 2       2         62      76       76        69      68
2  User 3       2         50      97       87        50      75
3  User 4       2         68      77       95        76      61
4  User 5       2         98      54       59        95      86

In [6]:
buddy.isnull().sum()

User Id      0
Sports       0
Religious    0
Nature       0
Theatre      0
Shopping     0
Picnic       0
dtype: int64

### Using the standard sqlite3 module:

- I opened a connection to a new (blank) database file buddymove_holidayiq.sqlite3
- Used df.to_sql (documentation) to insert the data into a new table review in the SQLite3 database

In [8]:
# Establish a connection to a new database
conn = sqlite3.connect('buddymove)holidayiq.sqlite3')

#Inserted the data into a new table called "review" in the database
buddy.to_sql(name = 'review', con = conn)

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

### Counting how many rows I have now

In [11]:
# Create a cursor.
curs1 = conn.cursor()

# Write a query
query1 = 'SELECT COUNT(*) FROM review;'

# Execute the query
total_rows = curs1.execute(query1).fetchall()

# Print Answer
print(total_rows)

[(249,)]

### How many users who reviewed at least 100 Nature in the category also reviewed at least 100 in the Shopping category?

In [0]:
#Create a cursor.
curs2 = conn.cursor()

In [24]:
#Write a query.
query2 = """
SELECT COUNT(*)
FROM review
WHERE Nature >= 100 AND Shopping >= 100;
"""

#Execute the query.
users = curs2.execute(query2).fetchall()

print(users)

[(78,)]

### (Stretch) What are the average number of reviews for each category?

In [25]:
#Create a cursor.
curs3 = conn.cursor()

#Write a query.
query3 = """
SELECT AVG(Sports), AVG(Religious), AVG(Nature), AVG(Theatre),
AVG(Shopping), AVG(Picnic)
FROM review;"""

#Execute the query()
avg_reviews_column = curs3.execute(query3).fetchall()

print(avg_reviews_column)

[(11.987951807228916, 109.77911646586345, 124.51807228915662, 116.37751004016064, 112.63855421686748, 120.40160642570281)]